In [1]:
import pandas as pd

In [2]:
url = 'http://bit.ly/dsa-transaction'
data = pd.read_csv(url)

print(data.shape)
data.head()

(8, 4)

   Name        date  price      state
0  Kang  2017-01-01    500  confirmed
1   Kim  2017-01-03    700  confirmed
2  Choi  2017-01-03    900  confirmed
3  Park  2017-01-05    800  confirmed
4   Lee  2017-01-07    500   canceled

## 데이터 구조(Data Structures), 데이터 타입(Data Type)

###  Series

In [3]:
odd = [1, 3, 5]

odd

[1, 3, 5]

In [4]:
# index
pd_odd = pd.Series(odd)

pd_odd

0    1
1    3
2    5
dtype: int64

### DataFrame

In [5]:
numbers = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]
]
    
numbers

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [6]:
# 주석
# 세로: 열(colums)
# 가로: 행(rows)

pd_numbers = pd.DataFrame(numbers)

# column별로 평균값을 구한다.
pd_numbers.mean()

0    4.0
1    5.0
2    6.0
dtype: float64

In [7]:
data = [
    ["2020-02-08", 300, "canceled"],
    ["2020-02-28", 500, "canceled"],
    ["2020-03-01", 700, "confirmed"]
    
]

data

[['2020-02-08', 300, 'canceled'],
 ['2020-02-28', 500, 'canceled'],
 ['2020-03-01', 700, 'confirmed']]

In [8]:
cols = ["date", "price", "result"]
idx = [1, 2, 3]

pd_data = pd.DataFrame(data, index=idx, columns=cols)

pd_data

         date  price     result
1  2020-02-08    300   canceled
2  2020-02-28    500   canceled
3  2020-03-01    700  confirmed

## 데이터 불러오기

In [9]:
# url = 'http://bit.ly/dsa-transaction'

data = pd.read_csv('data/transaction.csv', index_col="Name")

print(data.shape)
#data.head()
data.tail()

FileNotFoundError: [Errno 2] File b'data/transaction.csv' does not exist: b'data/transaction.csv'

In [ ]:
data.shape

In [ ]:
data.columns = ["date", "amount", "result"]

data

In [ ]:
data.index

In [ ]:
data.values

## 행렬 검색

### 열(columns) 검색

In [ ]:
data['date']

In [ ]:
data['amount']

In [ ]:
# data[['date', 'amount']]

cols = ['date', 'amount']

data[cols]

### 행(rows) 검색

In [ ]:
# loc = locate
data.loc['Kang']

In [ ]:
data.head()

In [ ]:
data.loc['Kim']

In [ ]:
data.loc[['Kang', 'Kim']]

In [ ]:
idx = ['Kang', 'Kim']

data.loc[idx]

### 행렬 동시 검색

In [ ]:
data.loc['Kang', 'result']

In [ ]:
cols = ['date', 'result']
idx = ['Kang', 'Kim']

data.loc[idx, cols]

## 기본 기능

In [ ]:
data['amount'].mean()

In [ ]:
data['amount'].quantile()

In [ ]:
data.describe()

In [ ]:
data.info()

In [ ]:
data['amount'].unique()

In [ ]:
data['amount'].nunique()

In [ ]:
data['amount'].value_counts(normalize=True)

In [ ]:
data['result'].replace('canceled', 'rejected')

In [ ]:
data['result'].str.replace('can', 'rejected')

In [ ]:
data.head().head(2).head(1)

In [ ]:
data.sort_values(by='amount', ascending=False)

In [ ]:
data.sort_values(by=['amount', 'date'], ascending=[True, False])

In [ ]:
#data.sort_index(axis='columns')
data.sort_index(axis=1)

## 색인(indexing)

In [ ]:
data[data['amount'] > 500]

In [ ]:
data[data['result'] == 'confirmed']

In [ ]:
data[data['date'] == '2017-01-03']

In [ ]:
# data[(data['amount'] > 500) | (data['result'] == 'confirmed')]

vip = (data['amount'] > 500)
confirmed = (data['result'] == 'confirmed')

cols = ['date', 'amount']
data.loc[vip&confirmed, cols].head()

## 행렬 추가/수정

In [ ]:
data['card-holder'] = 'KB Card'

data

In [ ]:
data['order'] = [1,2,3,4,5,6,7,8]

data

In [ ]:
data['VIP'] = data['amount'] > 500

data.head()

In [ ]:
data.loc[data['amount'] > 500, 'Rank'] = 'VIP'
data.loc[~(data['amount'] > 500), 'Rank'] = 'non-VIP'

cols = ['amount', 'Rank']

data[cols].head()

### 행렬 삭제

In [ ]:
del data['card-holder']

In [ ]:
del data['order']

In [ ]:
data.head()

In [ ]:
data_v2 = data.drop(columns=['amount', 'Rank'])

data_v2.head()

In [ ]:
data.drop(columns='Rank', inplace=True)

In [ ]:
data.head()

### Apply

In [ ]:
def is_vip(amount):
    return amount > 500

is_vip(600)

In [ ]:
data['amount'].apply(is_vip)

In [ ]:
def is_vip(row):
    return (row['amount'] > 500) and (row['result'] == 'confirmed')

is_vip(data.loc['Kang'])

In [ ]:
data.apply(is_vip, axis=1) #columns

## Lambda

In [ ]:
(lambda x : x + 1)(1)

In [ ]:
def add_1(x):
    return x + 1

add_1(1)

In [ ]:
data['price']

In [ ]:
# data['price'] > 500
data['price'].apply(lambda x : x > 500)

In [ ]:
data['price'].apply(lambda x : "VIP" if x > 500 else "non-VIP")

In [ ]:
data.apply(lambda row : row['price'] > 500, axis=1)

In [ ]:
data.apply(lambda row : "VIP" if row['price'] > 500 else 'non-VIP', axis=1)

In [ ]:
# data[data['price'] > 500]
data.head(10)[lambda row : row['price'] > 500]

In [ ]:
# data[data['Name'].str[0] == 'K']
# data[data['Name'].str.startswith('K')]
# data[data['Name'].apply(lambda x : x[0] == 'K')]
data.apply(lambda x : data['Name'].str[0] == 'K', axis=1)

##  Pivot Table

In [ ]:
pd.pivot_table(data=data, index='state', values='price',)

In [ ]:
data.pivot_table(index='state', values='price')

In [ ]:
data.pivot_table(index='state', columns='date', values='price').T #Transpose
# fill_value는 nan값을 넣어줌

In [ ]:
data.pivot_table(index='state', columns='date', values='price').stack().to_frame()

In [ ]:
data.pivot_table(index=['state', 'date'], values='price')

In [ ]:
import numpy as np

data.pivot_table(index='state', values='price', aggfunc=[np.mean, np.sum])

In [ ]:
import numpy as np

data.pivot_table(index=['state', 'date'], values='price', aggfunc=['mean',"sum"])#.reset_index()

In [ ]:
data.pivot_table(index='state', values='price', aggfunc=lambda df : df.mean())

In [ ]:
data.pivot_table(index='state', values='price', aggfunc=lambda df : df.max()-df.min())

In [ ]:
data.pivot_table(index='state', values='price', aggfunc=lambda df : [df.max(), df.min()])

## Groupby

In [ ]:
data.groupby(['state', 'date']).mean()

In [ ]:
data.groupby('state')['price'].nunique()#.to_frame()

In [ ]:
data.groupby('state')['price'].value_counts()

In [ ]:
data.groupby('state')['price'].cumsum()

In [ ]:
data.groupby(['state', 'date'])['price'].mean().unstack(level=0)

In [ ]:
data.groupby('state')['price'].apply(lambda df : df.max()-df.min())

## 데이터 병합

### concatenate

In [ ]:
url = 'http://bit.ly/dsa-01-order'

order = pd.read_csv(url)

print(order.shape)
order.head()

In [ ]:
url = 'http://bit.ly/dsa-02-order-how'

how = pd.read_csv(url)

print(how.shape)
how.head()

In [ ]:
order.head(1)

In [ ]:
how.head(1)

In [ ]:
pd.concat([order, how], axis=1)

### merge

In [10]:
#url = 'http://bit.ly/dsa-02-order-201701'
path = '../data/order-201701.csv'

order_01 = pd.read_csv(path)

print(order_01.shape)
order_01.head()

(7, 7)

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed

In [11]:
#url = 'http://bit.ly/dsa-02-order-201701'
path = '../data/order-201701.csv'

order_01 = pd.read_csv(path)

print(order_01.shape)
order_01.head()

(7, 7)

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed

In [12]:
#url = 'http://bit.ly/dsa-02-order-201701'
path = '../data/order-201702.csv'

order_02 = pd.read_csv(path)

print(order_02.shape)
order_02.head()

(4, 7)

   id  user_id  product_id        date  price  address      state
0   8        1           3  2017-02-04    600    Seoul  confirmed
1   9        4           8  2017-02-12    200  Daejeon   canceled
2  10        8           2  2017-02-15    650    Daegu  confirmed
3  11        2           6  2017-02-28    420    Busan  confirmed

In [13]:
order = pd.concat([order_01, order_02])

print(order.shape)
order.head()

(11, 7)

   id  user_id  product_id        date  price  address      state
0   1        3           9  2017-01-01    500    Seoul  confirmed
1   2        1           7  2017-01-03    700    Seoul  confirmed
2   3        3           8  2017-01-03    900  Daejeon  confirmed
3   4        4           2  2017-01-07    500      NaN   canceled
4   5        7           3  2017-01-09    700  Incheon  confirmed

In [14]:
path = '../data/product.csv'

product = pd.read_csv(path)

print(product.shape)
product.head()

(7, 3)

   id      title  price
0   1      apple    300
1   2  blueberry    500
2   3     banana    700
3   4     cereal   1000
4   5       kiwi    200

In [15]:
path = '../data/user.csv'

user = pd.read_csv(path)

print(user.shape)
user.head()

(7, 5)

   id  name  gender  age                email
0   1  Kang    male   30       kang@gmail.com
1   2   Kim  female   22        kim@naver.com
2   3  Park    male   37  park@dsschool.co.kr
3   4   Lee  female   15      lee@empas.co.kr
4   5   Son    male   29     son@google.co.uk

In [17]:
pd.merge(order, product, left_on="product_id", right_on='id')

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,2,1,7,2017-01-03,700,Seoul,confirmed,7,pineapple,700
1,6,5,7,2017-01-09,600,Busan,canceled,7,pineapple,700
2,4,4,2,2017-01-07,500,NaN,canceled,2,blueberry,500
3,10,8,2,2017-02-15,650,Daegu,confirmed,2,blueberry,500
4,5,7,3,2017-01-09,700,Incheon,confirmed,3,banana,700
5,8,1,3,2017-02-04,600,Seoul,confirmed,3,banana,700
6,7,2,5,2017-01-10,200,NaN,canceled,5,kiwi,200
7,11,2,6,2017-02-28,420,Busan,confirmed,6,melon,420

In [18]:
pd.merge(order, product, how='left', left_on="product_id", right_on='id')

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,1,3,9,2017-01-01,500,Seoul,confirmed,NaN,NaN,NaN
1,2,1,7,2017-01-03,700,Seoul,confirmed,7.0,pineapple,700.0
2,3,3,8,2017-01-03,900,Daejeon,confirmed,NaN,NaN,NaN
3,4,4,2,2017-01-07,500,NaN,canceled,2.0,blueberry,500.0
4,5,7,3,2017-01-09,700,Incheon,confirmed,3.0,banana,700.0
5,6,5,7,2017-01-09,600,Busan,canceled,7.0,pineapple,700.0
6,7,2,5,2017-01-10,200,NaN,canceled,5.0,kiwi,200.0
7,8,1,3,2017-02-04,600,Seoul,confirmed,3.0,banana,700.0
8,9,4,8,2017-02-12,200,Daejeon,canceled,NaN,NaN,NaN
9,10,8,2,2017-02-15,650,Daegu,confirmed,2.0,blueberry,500.0
10,11,2,6,2017-02-28,420,Busan,confirmed,6.0,melon,420.0

In [19]:
pd.merge(order, product, how='right', left_on="product_id", right_on='id')

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,2.0,1.0,7.0,2017-01-03,700.0,Seoul,confirmed,7,pineapple,700
1,6.0,5.0,7.0,2017-01-09,600.0,Busan,canceled,7,pineapple,700
2,4.0,4.0,2.0,2017-01-07,500.0,NaN,canceled,2,blueberry,500
3,10.0,8.0,2.0,2017-02-15,650.0,Daegu,confirmed,2,blueberry,500
4,5.0,7.0,3.0,2017-01-09,700.0,Incheon,confirmed,3,banana,700
5,8.0,1.0,3.0,2017-02-04,600.0,Seoul,confirmed,3,banana,700
6,7.0,2.0,5.0,2017-01-10,200.0,NaN,canceled,5,kiwi,200
7,11.0,2.0,6.0,2017-02-28,420.0,Busan,confirmed,6,melon,420
8,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,apple,300
9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4,cereal,1000

In [20]:
pd.merge(order, product, how='outer', left_on="product_id", right_on='id')

,id_x,user_id,product_id,date,price_x,address,state,id_y,title,price_y
0,1.0,3.0,9.0,2017-01-01,500.0,Seoul,confirmed,NaN,NaN,NaN
1,2.0,1.0,7.0,2017-01-03,700.0,Seoul,confirmed,7.0,pineapple,700.0
2,6.0,5.0,7.0,2017-01-09,600.0,Busan,canceled,7.0,pineapple,700.0
3,3.0,3.0,8.0,2017-01-03,900.0,Daejeon,confirmed,NaN,NaN,NaN
4,9.0,4.0,8.0,2017-02-12,200.0,Daejeon,canceled,NaN,NaN,NaN
5,4.0,4.0,2.0,2017-01-07,500.0,NaN,canceled,2.0,blueberry,500.0
6,10.0,8.0,2.0,2017-02-15,650.0,Daegu,confirmed,2.0,blueberry,500.0
7,5.0,7.0,3.0,2017-01-09,700.0,Incheon,confirmed,3.0,banana,700.0
8,8.0,1.0,3.0,2017-02-04,600.0,Seoul,confirmed,3.0,banana,700.0
9,7.0,2.0,5.0,2017-01-10,200.0,NaN,canceled,5.0,kiwi,200.0
10,11.0,2.0,6.0,2017-02-28,420.0,Busan,confirmed,6.0,melon,420.0
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0,apple,300.0
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,cereal,1000.0

In [21]:
pd.merge(order, product, on='id')

,id,user_id,product_id,date,price_x,address,state,title,price_y
0,1,3,9,2017-01-01,500,Seoul,confirmed,apple,300
1,2,1,7,2017-01-03,700,Seoul,confirmed,blueberry,500
2,3,3,8,2017-01-03,900,Daejeon,confirmed,banana,700
3,4,4,2,2017-01-07,500,NaN,canceled,cereal,1000
4,5,7,3,2017-01-09,700,Incheon,confirmed,kiwi,200
5,6,5,7,2017-01-09,600,Busan,canceled,melon,420
6,7,2,5,2017-01-10,200,NaN,canceled,pineapple,700

## NaN

In [ ]:
import numpy as np
np.nan

In [26]:
pd.np.nan

nan

In [27]:
type(np.nan)

float

In [28]:
np.nan + 1

nan

In [30]:
np.nan == np.nan

False

In [31]:
pd.isnull(np.nan)

True

In [32]:
np.nan is np.nan

True

In [34]:
type(None)

NoneType

In [35]:
None == None

True

In [36]:
None is None

True

In [37]:
pd.isnull(None)

True

In [38]:
#판다스에서는 NaN이나 None이나 동일한 값으로 취급한다.